$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.4',
          'Headers' => {
                         'atomic.h' => 1,
                         'chksum.h' => 1,
                         'cpumask.h' => 1,
                         'eth.h' => 1,
                         'init.h' => 1,
                         'ip.h' => 1,
                         'odph_cuckootable.h' => 1,
                         'odph_hashtable.h' => 1,
                         'odph_iplookuptable.h' => 1,
                         'odph_lineartable.h' => 1,
                         'packet.h' => 1,
                         'process.h' => 1,
                         'pthread.h' => 1,
                         'table.h' => 1,
                         'thread_types.h' => 1,
                         'threads.h' => 1,
                         'version.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libodphelper.so.123.0.0',
          'LibraryVersion' => '1.23.0.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libodp-linux.so.123' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'chksum.c' => 1,
                         'cuckootable.c' => 1,
                         'eth.c' => 1,

                                                        'odph_hash_table_create' => 1,
                                                        'odph_hash_table_destroy' => 1,
                                                        'odph_hash_table_lookup' => 1,
                                                        'odph_hash_table_ops' => -48,
                                                        'odph_iplookup_table_create' => 1,
                                                        'odph_iplookup_table_destroy' => 1,
                                                        'odph_iplookup_table_get_value' => 1,
                                                        'odph_iplookup_table_lookup' => 1,
                                                        'odph_iplookup_table_ops' => -48,
                                                        'odph_iplookup_table_put_value' => 1,
                                                        'odph_iplookup_table_remove_value' => 1,
                                                        'odph_ipv4_addr_parse' => 1,
                                                        'odph_linear_table_create' => 1,
                                                        'odph_linear_table_destroy' => 1,
                                                        'odph_linear_table_lookup' => 1,
                                                        'odph_linear_table_ops' => -48,
                                                        'odph_linux_process_fork' => 1,
                                                        'odph_linux_process_fork_n' => 1,
                                                        'odph_linux_process_wait_n' => 1,
                                                        'odph_linux_pthread_create' => 1,
                                                        'odph_linux_pthread_join' => 1,
                                                        'odph_odpthread_getaffinity' => 1,
                                                        'odph_odpthread_setaffinity' => 1,
                                                        'odph_odpthreads_create' => 1,
                                                        'odph_odpthreads_join' => 1,
                                                        'odph_options' => 1,
                                                        'odph_parse_options' => 1,
                                                        'odph_sctp_chksum_set' => 1,
                                                        'odph_sctp_chksum_verify' => 1,
                                                        'odph_thread_create' => 1,
                                                        'odph_thread_join' => 1,
                                                        'odph_udp_tcp_chksum' => 1,
                                                        'odph_version_str' => 1
                                                      }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '105' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1138' => {
                                      'BaseType' => '98',
                                      'Header' => 'stdint.h',
                                      'Line' => '51',
                                      'Name' => 'uint32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '123' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '159' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '161' => {
                                     'BaseType' => '123',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '167' => {
                                     'BaseType' => '173',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '173' => {
                                     'BaseType' => '123',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '1967' => {
                                      'BaseType' => '1138',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '199' => {
                                     'BaseType' => '73',
                                     'Name' => 'uint8_t[6]',
                                     'Size' => '6',
                                     'Type' => 'Array'
                                   },
                          '2131' => {
                                      'BaseType' => '91',
                                      'Header' => 'stdint.h',
                                      'Line' => '49',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '215' => {
                                     'Header' => 'eth.h',
                                     'Line' => '55',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'addr',
                                                          'offset' => '0',
                                                          'type' => '199'
                                                        }
                                               },
                                     'Name' => 'struct odph_ethaddr_t',
                                     'Size' => '6',
                                     'Type' => 'Struct'
                                   },
                          '2256' => {
                                      'Header' => 'packet.h',
                                      'Line' => '17',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'dummy',
                                                           'offset' => '0',
                                                           'type' => '123'
                                                         }
                                                },
                                      'Name' => 'struct _odp_abi_packet_t',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '2299' => {
                                      'BaseType' => '2310',
                                      'Header' => 'packet.h',
                                      'Line' => '26',
                                      'Name' => 'odp_packet_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2310' => {
                                      'BaseType' => '2256',
                                      'Name' => '_odp_abi_packet_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2431' => {
                                      'Header' => 'chksum.h',
                                      'Line' => '35',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODPH_CHKSUM_GENERATE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODPH_CHKSUM_VERIFY',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'ODPH_CHKSUM_RETURN',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum odph_chksum_op_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3496' => {
                                      'BaseType' => '2131',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '35784' => {
                                       'BaseType' => '59',
                                       'Header' => 'types.h',
                                       'Line' => '133',
                                       'Name' => '__pid_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '35839' => {
                                       'BaseType' => '35784',
                                       'Header' => 'sched.h',
                                       'Line' => '35',
                                       'Name' => 'pid_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '35922' => {
                                       'BaseType' => '59',
                                       'Name' => 'int const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '35938' => {
                                       'BaseType' => '105',
                                       'Header' => 'pthreadtypes.h',
                                       'Line' => '60',
                                       'Name' => 'pthread_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '35949' => {
                                       'Header' => 'pthreadtypes.h',
                                       'Line' => '63',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '__size',
                                                            'offset' => '0',
                                                            'type' => '35984'
                                                          },
                                                   '1' => {
                                                            'name' => '__align',
                                                            'offset' => '0',
                                                            'type' => '66'
                                                          }
                                                 },
                                       'Name' => 'union pthread_attr_t',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Union'
                                     },
                          '35984' => {
                                       'BaseType' => '123',
                                       'Name' => 'char[56]',
                                       'Size' => '56',
                                       'Type' => 'Array'
                                     },
                          '36000' => {
                                       'BaseType' => '35949',
                                       'Header' => 'pthreadtypes.h',
                                       'Line' => '69',
                                       'Name' => 'pthread_attr_t',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '36184' => {
                                       'Header' => 'thread_types.h',
                                       'Line' => '27',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_THREAD_WORKER',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_THREAD_CONTROL',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_thread_type_e',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '36209' => {
                                       'BaseType' => '36184',
                                       'Header' => 'thread_types.h',
                                       'Line' => '49',
                                       'Name' => 'odp_thread_type_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '36220' => {
                                       'Header' => 'cpumask.h',
                                       'Line' => '37',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_u8',
                                                            'offset' => '0',
                                                            'type' => '36245'
                                                          }
                                                 },
                                       'Name' => 'struct odp_cpumask_t',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '36245' => {
                                       'BaseType' => '73',
                                       'Name' => 'uint8_t[128]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '36261' => {
                                       'BaseType' => '36220',
                                       'Header' => 'cpumask.h',
                                       'Line' => '44',
                                       'Name' => 'odp_cpumask_t',
                                       'Size' => '128',
                                       'Type' => 'Typedef'
                                     },
                          '36306' => {
                                       'BaseType' => '7539',
                                       'Header' => 'init.h',
                                       'Line' => '22',
                                       'Name' => 'odp_instance_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '36338' => {
                                       'Header' => 'init.h',
                                       'Line' => '123',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_MEM_MODEL_THREAD',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_MEM_MODEL_PROCESS',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_mem_model_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '36349' => {
                                       'BaseType' => '36355',
                                       'Name' => 'odp_cpumask_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '36355' => {
                                       'BaseType' => '36261',
                                       'Name' => 'odp_cpumask_t const',
                                       'Size' => '128',
                                       'Type' => 'Const'
                                     },
                          '36375' => {
                                       'Name' => 'void*(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '159'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '36453' => {
                                       'Name' => 'int(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '159'
                                                           }
                                                  },
                                       'Return' => '59',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '36459' => {
                                       'Header' => 'threads.h',
                                       'Line' => '72',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start',
                                                            'offset' => '0',
                                                            'type' => '36453'
                                                          },
                                                   '1' => {
                                                            'name' => 'arg',
                                                            'offset' => '8',
                                                            'type' => '159'
                                                          },
                                                   '2' => {
                                                            'name' => 'thr_type',
                                                            'offset' => '16',
                                                            'type' => '36209'
                                                          },
                                                   '3' => {
                                                            'name' => 'instance',
                                                            'offset' => '24',
                                                            'type' => '36306'
                                                          }
                                                 },
                                       'Name' => 'struct odph_thread_param_t',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '36527' => {
                                       'Header' => 'threads.h',
                                       'Line' => '89',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'status',
                                                            'offset' => '0',
                                                            'type' => '8097'
                                                          },
                                                   '1' => {
                                                            'name' => 'mem_model',
                                                            'offset' => '4',
                                                            'type' => '36338'
                                                          },
                                                   '2' => {
                                                            'name' => 'instance',
                                                            'offset' => '8',
                                                            'type' => '36306'
                                                          },
                                                   '3' => {
                                                            'name' => 'thr_params',
                                                            'offset' => '16',
                                                            'type' => '36459'
                                                          }
                                                 },
                                       'Name' => 'struct odph_thread_start_args_t',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '36538' => {
                                       'Header' => 'threads.h',
                                       'Line' => '105',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'thread_id',
                                                            'offset' => '0',
                                                            'type' => '35938'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr',
                                                            'offset' => '8',
                                                            'type' => '36000'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-threads.h-105',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '36571' => {
                                       'Header' => 'threads.h',
                                       'Line' => '111',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pid',
                                                            'offset' => '0',
                                                            'type' => '35839'
                                                          },
                                                   '1' => {
                                                            'name' => 'status',
                                                            'offset' => '4',
                                                            'type' => '59'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-threads.h-111',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '36604' => {
                                       'Header' => 'threads.h',
                                       'Line' => '103',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'thread',
                                                            'offset' => '0',
                                                            'type' => '36538'
                                                          },
                                                   '1' => {
                                                            'name' => 'proc',
                                                            'offset' => '0',
                                                            'type' => '36571'
                                                          }
                                                 },
                                       'Name' => 'anon-union-threads.h-103',
                                       'Size' => '64',
                                       'Type' => 'Union'
                                     },
                          '36686' => {
                                       'Header' => 'threads.h',
                                       'Line' => '117',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start_args',
                                                            'offset' => '0',
                                                            'type' => '36527'
                                                          },
                                                   '1' => {
                                                            'name' => 'cpu',
                                                            'offset' => '48',
                                                            'type' => '59'
                                                          },
                                                   '2' => {
                                                            'name' => 'last',
                                                            'offset' => '52',
                                                            'type' => '73'
                                                          },
                                                   '3' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '56',
                                                            'type' => '36604'
                                                          }
                                                 },
                                       'Name' => 'struct odph_thread_t',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '36718' => {
                                       'Header' => 'threads.h',
                                       'Line' => '122',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mem_model',
                                                            'offset' => '0',
                                                            'type' => '36338'
                                                          }
                                                 },
                                       'Name' => 'struct odph_helper_options_t',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '36729' => {
                                       'BaseType' => '36686',
                                       'Header' => 'threads.h',
                                       'Line' => '125',
                                       'Name' => 'odph_odpthread_t',
                                       'Size' => '120',
                                       'Type' => 'Typedef'
                                     },
                          '36740' => {
                                       'BaseType' => '36459',
                                       'Header' => 'threads.h',
                                       'Line' => '128',
                                       'Name' => 'odph_odpthread_params_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '36820' => {
                                       'Header' => 'threads.h',
                                       'Line' => '179',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'instance',
                                                            'offset' => '0',
                                                            'type' => '36306'
                                                          },
                                                   '1' => {
                                                            'name' => 'cpumask',
                                                            'offset' => '8',
                                                            'type' => '36349'
                                                          },
                                                   '2' => {
                                                            'name' => 'thread_model',
                                                            'offset' => '16',
                                                            'type' => '59'
                                                          },
                                                   '3' => {
                                                            'name' => 'sync',
                                                            'offset' => '20',
                                                            'type' => '59'
                                                          },
                                                   '4' => {
                                                            'name' => 'share_param',
                                                            'offset' => '24',
                                                            'type' => '59'
                                                          }
                                                 },
                                       'Name' => 'struct odph_thread_common_param_t',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '37875' => {
                                       'BaseType' => '36686',
                                       'Name' => 'odph_thread_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41127' => {
                                       'BaseType' => '41133',
                                       'Name' => 'odph_thread_common_param_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41133' => {
                                       'BaseType' => '36820',
                                       'Name' => 'odph_thread_common_param_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '41138' => {
                                       'BaseType' => '41144',
                                       'Name' => 'odph_thread_param_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41144' => {
                                       'BaseType' => '36459',
                                       'Name' => 'odph_thread_param_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '41944' => {
                                       'BaseType' => '36729',
                                       'Name' => 'odph_odpthread_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41950' => {
                                       'BaseType' => '41956',
                                       'Name' => 'odph_odpthread_params_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41956' => {
                                       'BaseType' => '36740',
                                       'Name' => 'odph_odpthread_params_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '43730' => {
                                       'BaseType' => '161',
                                       'Name' => 'char**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43785' => {
                                       'BaseType' => '36718',
                                       'Name' => 'odph_helper_options_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46087' => {
                                       'Header' => 'threads.h',
                                       'Line' => '40',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start',
                                                            'offset' => '0',
                                                            'type' => '36375'
                                                          },
                                                   '1' => {
                                                            'name' => 'arg',
                                                            'offset' => '8',
                                                            'type' => '159'
                                                          },
                                                   '2' => {
                                                            'name' => 'thr_type',
                                                            'offset' => '16',
                                                            'type' => '36209'
                                                          },
                                                   '3' => {
                                                            'name' => 'instance',
                                                            'offset' => '24',
                                                            'type' => '36306'
                                                          }
                                                 },
                                       'Name' => 'struct odph_linux_thr_params_t',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '46155' => {
                                       'Header' => 'threads.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'thread',
                                                            'offset' => '0',
                                                            'type' => '35938'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr',
                                                            'offset' => '8',
                                                            'type' => '36000'
                                                          },
                                                   '2' => {
                                                            'name' => 'cpu',
                                                            'offset' => '64',
                                                            'type' => '59'
                                                          },
                                                   '3' => {
                                                            'name' => 'thr_params',
                                                            'offset' => '72',
                                                            'type' => '46087'
                                                          }
                                                 },
                                       'Name' => 'struct odph_linux_pthread_t',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '46211' => {
                                       'Header' => 'threads.h',
                                       'Line' => '56',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pid',
                                                            'offset' => '0',
                                                            'type' => '35839'
                                                          },
                                                   '1' => {
                                                            'name' => 'cpu',
                                                            'offset' => '4',
                                                            'type' => '59'
                                                          },
                                                   '2' => {
                                                            'name' => 'status',
                                                            'offset' => '8',
                                                            'type' => '59'
                                                          }
                                                 },
                                       'Name' => 'struct odph_linux_process_t',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '47507' => {
                                       'BaseType' => '46155',
                                       'Name' => 'odph_linux_pthread_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47513' => {
                                       'BaseType' => '47519',
                                       'Name' => 'odph_linux_thr_params_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47519' => {
                                       'BaseType' => '46087',
                                       'Name' => 'odph_linux_thr_params_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '48790' => {
                                       'BaseType' => '46211',
                                       'Name' => 'odph_linux_process_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '66' => {
                                    'Name' => 'long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '73' => {
                                    'BaseType' => '84',
                                    'Header' => 'stdint.h',
                                    'Line' => '48',
                                    'Name' => 'uint8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '7539' => {
                                      'BaseType' => '105',
                                      'Header' => 'stdint.h',
                                      'Line' => '55',
                                      'Name' => 'uint64_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7550' => {
                                      'Header' => 'table.h',
                                      'Line' => '98',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '73'
                                                         }
                                                },
                                      'Name' => 'anon-struct-table.h-98',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '7571' => {
                                      'BaseType' => '7582',
                                      'Header' => 'table.h',
                                      'Line' => '98',
                                      'Name' => 'odph_table_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7582' => {
                                      'BaseType' => '7550',
                                      'Name' => 'anon-struct-table.h-98*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7588' => {
                                      'BaseType' => '7599',
                                      'Header' => 'table.h',
                                      'Line' => '117',
                                      'Name' => 'odph_table_create',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7599' => {
                                      'Name' => 'odph_table_t(*)(char const*, uint32_t, uint32_t, uint32_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '167'
                                                          },
                                                   '1' => {
                                                            'type' => '1138'
                                                          },
                                                   '2' => {
                                                            'type' => '1138'
                                                          },
                                                   '3' => {
                                                            'type' => '1138'
                                                          }
                                                 },
                                      'Return' => '7571',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7635' => {
                                      'BaseType' => '7646',
                                      'Header' => 'table.h',
                                      'Line' => '134',
                                      'Name' => 'odph_table_lookup',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7646' => {
                                      'Name' => 'odph_table_t(*)(char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '167'
                                                          }
                                                 },
                                      'Return' => '7571',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7667' => {
                                      'BaseType' => '7678',
                                      'Header' => 'table.h',
                                      'Line' => '148',
                                      'Name' => 'odph_table_destroy',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7678' => {
                                      'Name' => 'int(*)(odph_table_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7571'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7699' => {
                                      'BaseType' => '7710',
                                      'Header' => 'table.h',
                                      'Line' => '170',
                                      'Name' => 'odph_table_put_value',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7710' => {
                                      'Name' => 'int(*)(odph_table_t, void*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7571'
                                                          },
                                                   '1' => {
                                                            'type' => '159'
                                                          },
                                                   '2' => {
                                                            'type' => '159'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7741' => {
                                      'BaseType' => '7752',
                                      'Header' => 'table.h',
                                      'Line' => '199',
                                      'Name' => 'odph_table_get_value',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7752' => {
                                      'Name' => 'int(*)(odph_table_t, void*, void*, uint32_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7571'
                                                          },
                                                   '1' => {
                                                            'type' => '159'
                                                          },
                                                   '2' => {
                                                            'type' => '159'
                                                          },
                                                   '3' => {
                                                            'type' => '1138'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7788' => {
                                      'BaseType' => '7799',
                                      'Header' => 'table.h',
                                      'Line' => '219',
                                      'Name' => 'odph_table_remove_value',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7799' => {
                                      'Name' => 'int(*)(odph_table_t, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7571'
                                                          },
                                                   '1' => {
                                                            'type' => '159'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7825' => {
                                      'Header' => 'table.h',
                                      'Line' => '224',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'f_create',
                                                           'offset' => '0',
                                                           'type' => '7588'
                                                         },
                                                  '1' => {
                                                           'name' => 'f_lookup',
                                                           'offset' => '8',
                                                           'type' => '7635'
                                                         },
                                                  '2' => {
                                                           'name' => 'f_des',
                                                           'offset' => '16',
                                                           'type' => '7667'
                                                         },
                                                  '3' => {
                                                           'name' => 'f_put',
                                                           'offset' => '24',
                                                           'type' => '7699'
                                                         },
                                                  '4' => {
                                                           'name' => 'f_get',
                                                           'offset' => '32',
                                                           'type' => '7741'
                                                         },
                                                  '5' => {
                                                           'name' => 'f_remove',
                                                           'offset' => '40',
                                                           'type' => '7788'
                                                         }
                                                },
                                      'Name' => 'struct odph_table_ops_t',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7910' => {
                                      'BaseType' => '7825',
                                      'Header' => 'table.h',
                                      'Line' => '234',
                                      'Name' => 'odph_table_ops_t',
                                      'Size' => '48',
                                      'Type' => 'Typedef'
                                    },
                          '8074' => {
                                      'Header' => 'atomic.h',
                                      'Line' => '27',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'v',
                                                           'offset' => '0',
                                                           'type' => '1138'
                                                         }
                                                },
                                      'Name' => 'struct odp_atomic_u32_s',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '8097' => {
                                      'BaseType' => '8074',
                                      'Header' => 'atomic.h',
                                      'Line' => '64',
                                      'Name' => 'odp_atomic_u32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '84' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '91' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '978' => {
                                     'BaseType' => '215',
                                     'Name' => 'odph_ethaddr_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '98' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libodphelper.so.123.0.0' => {
                                                                 '_ITM_deregisterTMCloneTable' => 0,
                                                                 '_ITM_registerTMCloneTable' => 0,
                                                                 '_Jv_RegisterClasses' => 0,
                                                                 '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                                 '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                                 '__gmon_start__' => 0,
                                                                 '__isoc99_sscanf@GLIBC_2.7' => 0,
                                                                 '__printf_chk@GLIBC_2.3.4' => 0,
                                                                 '__sched_cpucount@GLIBC_2.6' => 0,
                                                                 '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                                 '__sprintf_chk@GLIBC_2.3.4' => 0,
                                                                 '__stack_chk_fail@GLIBC_2.4' => 0,
                                                                 '_exit@GLIBC_2.2.5' => 0,
                                                                 'fork@GLIBC_2.2.5' => 0,
                                                                 'getenv@GLIBC_2.2.5' => 0,
                                                                 'getpid@GLIBC_2.2.5' => 0,
                                                                 'getppid@GLIBC_2.2.5' => 0,
                                                                 'kill@GLIBC_2.2.5' => 0,
                                                                 'memcmp@GLIBC_2.2.5' => 0,
                                                                 'memcpy@GLIBC_2.14' => 0,
                                                                 'memset@GLIBC_2.2.5' => 0,
                                                                 'odp_atomic_init_u32' => 0,
                                                                 'odp_atomic_load_acq_u32' => 0,
                                                                 'odp_atomic_load_u32' => 0,
                                                                 'odp_atomic_store_rel_u32' => 0,
                                                                 'odp_atomic_store_u32' => 0,
                                                                 'odp_be_to_cpu_16' => 0,
                                                                 'odp_buffer_addr' => 0,
                                                                 'odp_buffer_alloc' => 0,
                                                                 'odp_buffer_free' => 0,
                                                                 'odp_buffer_from_event' => 0,
                                                                 'odp_buffer_to_event' => 0,
                                                                 'odp_cpu_count' => 0,
                                                                 'odp_cpu_pause' => 0,
                                                                 'odp_cpumask_count' => 0,
                                                                 'odp_cpumask_first' => 0,
                                                                 'odp_cpumask_next' => 0,
                                                                 'odp_cpumask_set' => 0,
                                                                 'odp_cpumask_zero' => 0,
                                                                 'odp_hash_crc32c' => 0,
                                                                 'odp_init_local' => 0,
                                                                 'odp_packet_copy_from_mem' => 0,
                                                                 'odp_packet_copy_to_mem' => 0,
                                                                 'odp_packet_has_ipv4' => 0,
                                                                 'odp_packet_has_ipv6' => 0,
                                                                 'odp_packet_has_sctp' => 0,
                                                                 'odp_packet_has_tcp' => 0,
                                                                 'odp_packet_has_udp' => 0,
                                                                 'odp_packet_l3_offset' => 0,
                                                                 'odp_packet_l3_ptr' => 0,
                                                                 'odp_packet_l4_offset' => 0,
                                                                 'odp_packet_l4_ptr' => 0,
                                                                 'odp_packet_len' => 0,
                                                                 'odp_packet_offset' => 0,
                                                                 'odp_pool_capability' => 0,
                                                                 'odp_pool_create' => 0,
                                                                 'odp_pool_destroy' => 0,
                                                                 'odp_pool_lookup' => 0,
                                                                 'odp_pool_param_init' => 0,
                                                                 'odp_queue_capability' => 0,
                                                                 'odp_queue_create' => 0,
                                                                 'odp_queue_deq' => 0,
                                                                 'odp_queue_destroy' => 0,
                                                                 'odp_queue_enq' => 0,
                                                                 'odp_queue_param_init' => 0,
                                                                 'odp_rwlock_init' => 0,
                                                                 'odp_rwlock_read_lock' => 0,
                                                                 'odp_rwlock_read_unlock' => 0,
                                                                 'odp_rwlock_write_lock' => 0,
                                                                 'odp_rwlock_write_unlock' => 0,
                                                                 'odp_shm_addr' => 0,
                                                                 'odp_shm_free' => 0,
                                                                 'odp_shm_lookup' => 0,
                                                                 'odp_shm_reserve' => 0,
                                                                 'odp_term_local' => 0,
                                                                 'odp_time_diff_ns' => 0,
                                                                 'odp_time_local' => 0,
                                                                 'prctl@GLIBC_2.2.5' => 0,
                                                                 'pthread_attr_destroy@GLIBC_2.2.5' => 0,
                                                                 'pthread_attr_init@GLIBC_2.2.5' => 0,
                                                                 'pthread_attr_setaffinity_np@GLIBC_2.3.4' => 0,
                                                                 'pthread_create@GLIBC_2.2.5' => 0,
                                                                 'pthread_getaffinity_np@GLIBC_2.3.4' => 0,
                                                                 'pthread_join@GLIBC_2.2.5' => 0,
                                                                 'pthread_self@GLIBC_2.2.5' => 0,
                                                                 'pthread_setaffinity_np@GLIBC_2.3.4' => 0,
                                                                 'sched_getaffinity@GLIBC_2.3.4' => 0,
                                                                 'sched_setaffinity@GLIBC_2.3.4' => 0,
                                                                 'snprintf@GLIBC_2.2.5' => 0,
                                                                 'stderr@GLIBC_2.2.5' => 0,
                                                                 'strcmp@GLIBC_2.2.5' => 0,
                                                                 'strncpy@GLIBC_2.2.5' => 0,
                                                                 'strsignal@GLIBC_2.2.5' => 0,
                                                                 'strtol@GLIBC_2.2.5' => 0,
                                                                 'syscall@GLIBC_2.2.5' => 0,
                                                                 'wait@GLIBC_2.2.5' => 0,
                                                                 'waitpid@GLIBC_2.2.5' => 0
                                                               }
                                },
          'WordSize' => '8'
        };
