$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.4',
          'Headers' => {
                         'chksum.h' => 1,
                         'cpumask.h' => 1,
                         'eth.h' => 1,
                         'init.h' => 1,
                         'ip.h' => 1,
                         'odph_cuckootable.h' => 1,
                         'odph_hashtable.h' => 1,
                         'odph_iplookuptable.h' => 1,
                         'odph_lineartable.h' => 1,
                         'packet.h' => 1,
                         'process.h' => 1,
                         'pthread.h' => 1,
                         'table.h' => 1,
                         'thread_types.h' => 1,
                         'threads.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libodphelper.so.120.0.0',
          'LibraryVersion' => '1.20.0.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libodp-linux.so.120' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'chksum.c' => 1,
                         'cuckootable.c' => 1,
                         'eth.c' => 1,
                         'hashtable.c' => 1,
                         'ip.c' => 1,

                                                        'odph_hash_get_value' => 1,
                                                        'odph_hash_put_value' => 1,
                                                        'odph_hash_remove_value' => 1,
                                                        'odph_hash_table_create' => 1,
                                                        'odph_hash_table_destroy' => 1,
                                                        'odph_hash_table_lookup' => 1,
                                                        'odph_hash_table_ops' => -48,
                                                        'odph_iplookup_table_create' => 1,
                                                        'odph_iplookup_table_destroy' => 1,
                                                        'odph_iplookup_table_get_value' => 1,
                                                        'odph_iplookup_table_lookup' => 1,
                                                        'odph_iplookup_table_ops' => -48,
                                                        'odph_iplookup_table_put_value' => 1,
                                                        'odph_iplookup_table_remove_value' => 1,
                                                        'odph_ipv4_addr_parse' => 1,
                                                        'odph_linear_table_create' => 1,
                                                        'odph_linear_table_destroy' => 1,
                                                        'odph_linear_table_lookup' => 1,
                                                        'odph_linear_table_ops' => -48,
                                                        'odph_linux_process_fork' => 1,
                                                        'odph_linux_process_fork_n' => 1,
                                                        'odph_linux_process_wait_n' => 1,
                                                        'odph_linux_pthread_create' => 1,
                                                        'odph_linux_pthread_join' => 1,
                                                        'odph_odpthread_getaffinity' => 1,
                                                        'odph_odpthread_setaffinity' => 1,
                                                        'odph_odpthreads_create' => 1,
                                                        'odph_odpthreads_join' => 1,
                                                        'odph_options' => 1,
                                                        'odph_parse_options' => 1,
                                                        'odph_sctp_chksum_set' => 1,
                                                        'odph_sctp_chksum_verify' => 1,
                                                        'odph_udp_tcp_chksum' => 1
                                                      }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '105' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1134' => {
                                      'BaseType' => '98',
                                      'Header' => 'stdint.h',
                                      'Line' => '51',
                                      'Name' => 'uint32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '152' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '154' => {
                                     'BaseType' => '160',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '160' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '167' => {
                                     'BaseType' => '173',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '173' => {
                                     'BaseType' => '160',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '1963' => {
                                      'BaseType' => '1134',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '199' => {
                                     'BaseType' => '73',
                                     'Name' => 'uint8_t[6]',
                                     'Size' => '6',
                                     'Type' => 'Array'
                                   },
                          '2123' => {
                                      'BaseType' => '91',
                                      'Header' => 'stdint.h',
                                      'Line' => '49',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '215' => {
                                     'Header' => 'eth.h',
                                     'Line' => '55',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'addr',
                                                          'offset' => '0',
                                                          'type' => '199'
                                                        }
                                               },
                                     'Name' => 'struct odph_ethaddr_t',
                                     'Size' => '6',
                                     'Type' => 'Struct'
                                   },
                          '2290' => {
                                      'Header' => 'packet.h',
                                      'Line' => '17',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'dummy',
                                                           'offset' => '0',
                                                           'type' => '160'
                                                         }
                                                },
                                      'Name' => 'struct _odp_abi_packet_t',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '2333' => {
                                      'BaseType' => '2344',
                                      'Header' => 'packet.h',
                                      'Line' => '26',
                                      'Name' => 'odp_packet_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2344' => {
                                      'BaseType' => '2290',
                                      'Name' => '_odp_abi_packet_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2423' => {
                                      'Header' => 'chksum.h',
                                      'Line' => '35',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODPH_CHKSUM_GENERATE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODPH_CHKSUM_VERIFY',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'ODPH_CHKSUM_RETURN',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum odph_chksum_op_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3488' => {
                                      'BaseType' => '2123',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '35697' => {
                                       'BaseType' => '59',
                                       'Header' => 'types.h',
                                       'Line' => '133',
                                       'Name' => '__pid_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '35752' => {
                                       'BaseType' => '35697',
                                       'Header' => 'sched.h',
                                       'Line' => '35',
                                       'Name' => 'pid_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '35835' => {
                                       'BaseType' => '59',
                                       'Name' => 'int const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '35851' => {
                                       'BaseType' => '105',
                                       'Header' => 'pthreadtypes.h',
                                       'Line' => '60',
                                       'Name' => 'pthread_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '35862' => {
                                       'Header' => 'pthreadtypes.h',
                                       'Line' => '63',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '__size',
                                                            'offset' => '0',
                                                            'type' => '35897'
                                                          },
                                                   '1' => {
                                                            'name' => '__align',
                                                            'offset' => '0',
                                                            'type' => '66'
                                                          }
                                                 },
                                       'Name' => 'union pthread_attr_t',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Union'
                                     },
                          '35897' => {
                                       'BaseType' => '160',
                                       'Name' => 'char[56]',
                                       'Size' => '56',
                                       'Type' => 'Array'
                                     },
                          '35913' => {
                                       'BaseType' => '35862',
                                       'Header' => 'pthreadtypes.h',
                                       'Line' => '69',
                                       'Name' => 'pthread_attr_t',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '35971' => {
                                       'Header' => 'thread_types.h',
                                       'Line' => '27',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_THREAD_WORKER',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_THREAD_CONTROL',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_thread_type_e',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '35996' => {
                                       'BaseType' => '35971',
                                       'Header' => 'thread_types.h',
                                       'Line' => '49',
                                       'Name' => 'odp_thread_type_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '36007' => {
                                       'Header' => 'cpumask.h',
                                       'Line' => '37',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_u8',
                                                            'offset' => '0',
                                                            'type' => '36032'
                                                          }
                                                 },
                                       'Name' => 'struct odp_cpumask_t',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '36032' => {
                                       'BaseType' => '73',
                                       'Name' => 'uint8_t[128]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '36048' => {
                                       'BaseType' => '36007',
                                       'Header' => 'cpumask.h',
                                       'Line' => '44',
                                       'Name' => 'odp_cpumask_t',
                                       'Size' => '128',
                                       'Type' => 'Typedef'
                                     },
                          '36059' => {
                                       'BaseType' => '7531',
                                       'Header' => 'init.h',
                                       'Line' => '22',
                                       'Name' => 'odp_instance_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '36091' => {
                                       'Header' => 'init.h',
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_MEM_MODEL_THREAD',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_MEM_MODEL_PROCESS',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_mem_model_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '36102' => {
                                       'BaseType' => '36108',
                                       'Name' => 'odp_cpumask_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '36108' => {
                                       'BaseType' => '36048',
                                       'Name' => 'odp_cpumask_t const',
                                       'Size' => '128',
                                       'Type' => 'Const'
                                     },
                          '36171' => {
                                       'Name' => 'void*(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '152'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '36249' => {
                                       'Name' => 'int(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '152'
                                                           }
                                                  },
                                       'Return' => '59',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '36255' => {
                                       'Header' => 'threads.h',
                                       'Line' => '63',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start',
                                                            'offset' => '0',
                                                            'type' => '36249'
                                                          },
                                                   '1' => {
                                                            'name' => 'arg',
                                                            'offset' => '8',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'thr_type',
                                                            'offset' => '16',
                                                            'type' => '35996'
                                                          },
                                                   '3' => {
                                                            'name' => 'instance',
                                                            'offset' => '24',
                                                            'type' => '36059'
                                                          }
                                                 },
                                       'Name' => 'struct odph_odpthread_params_t',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '36299' => {
                                       'Header' => 'threads.h',
                                       'Line' => '69',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mem_model',
                                                            'offset' => '0',
                                                            'type' => '36091'
                                                          },
                                                   '1' => {
                                                            'name' => 'thr_params',
                                                            'offset' => '8',
                                                            'type' => '36255'
                                                          }
                                                 },
                                       'Name' => 'struct odph_odpthread_start_args_t',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '36310' => {
                                       'Header' => 'threads.h',
                                       'Line' => '79',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'thread_id',
                                                            'offset' => '0',
                                                            'type' => '35851'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr',
                                                            'offset' => '8',
                                                            'type' => '35913'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-threads.h-79',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '36343' => {
                                       'Header' => 'threads.h',
                                       'Line' => '84',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pid',
                                                            'offset' => '0',
                                                            'type' => '35752'
                                                          },
                                                   '1' => {
                                                            'name' => 'status',
                                                            'offset' => '4',
                                                            'type' => '59'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-threads.h-84',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '36376' => {
                                       'Header' => 'threads.h',
                                       'Line' => '77',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'thread',
                                                            'offset' => '0',
                                                            'type' => '36310'
                                                          },
                                                   '1' => {
                                                            'name' => 'proc',
                                                            'offset' => '0',
                                                            'type' => '36343'
                                                          }
                                                 },
                                       'Name' => 'anon-union-threads.h-77',
                                       'Size' => '64',
                                       'Type' => 'Union'
                                     },
                          '36458' => {
                                       'Header' => 'threads.h',
                                       'Line' => '89',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start_args',
                                                            'offset' => '0',
                                                            'type' => '36299'
                                                          },
                                                   '1' => {
                                                            'name' => 'cpu',
                                                            'offset' => '40',
                                                            'type' => '59'
                                                          },
                                                   '2' => {
                                                            'name' => 'last',
                                                            'offset' => '44',
                                                            'type' => '59'
                                                          },
                                                   '3' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '48',
                                                            'type' => '36376'
                                                          }
                                                 },
                                       'Name' => 'struct odph_odpthread_t',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '36490' => {
                                       'Header' => 'threads.h',
                                       'Line' => '94',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mem_model',
                                                            'offset' => '0',
                                                            'type' => '36091'
                                                          }
                                                 },
                                       'Name' => 'struct odph_helper_options_t',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '37560' => {
                                       'BaseType' => '36458',
                                       'Name' => 'odph_odpthread_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37566' => {
                                       'BaseType' => '37572',
                                       'Name' => 'odph_odpthread_params_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37572' => {
                                       'BaseType' => '36255',
                                       'Name' => 'odph_odpthread_params_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '40893' => {
                                       'BaseType' => '154',
                                       'Name' => 'char**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40948' => {
                                       'BaseType' => '36490',
                                       'Name' => 'odph_helper_options_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43003' => {
                                       'Header' => 'threads.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start',
                                                            'offset' => '0',
                                                            'type' => '36171'
                                                          },
                                                   '1' => {
                                                            'name' => 'arg',
                                                            'offset' => '8',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'thr_type',
                                                            'offset' => '16',
                                                            'type' => '35996'
                                                          },
                                                   '3' => {
                                                            'name' => 'instance',
                                                            'offset' => '24',
                                                            'type' => '36059'
                                                          }
                                                 },
                                       'Name' => 'struct odph_linux_thr_params_t',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '43071' => {
                                       'Header' => 'threads.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'thread',
                                                            'offset' => '0',
                                                            'type' => '35851'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr',
                                                            'offset' => '8',
                                                            'type' => '35913'
                                                          },
                                                   '2' => {
                                                            'name' => 'cpu',
                                                            'offset' => '64',
                                                            'type' => '59'
                                                          },
                                                   '3' => {
                                                            'name' => 'thr_params',
                                                            'offset' => '72',
                                                            'type' => '43003'
                                                          }
                                                 },
                                       'Name' => 'struct odph_linux_pthread_t',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '43127' => {
                                       'Header' => 'threads.h',
                                       'Line' => '55',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pid',
                                                            'offset' => '0',
                                                            'type' => '35752'
                                                          },
                                                   '1' => {
                                                            'name' => 'cpu',
                                                            'offset' => '4',
                                                            'type' => '59'
                                                          },
                                                   '2' => {
                                                            'name' => 'status',
                                                            'offset' => '8',
                                                            'type' => '59'
                                                          }
                                                 },
                                       'Name' => 'struct odph_linux_process_t',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '44423' => {
                                       'BaseType' => '43071',
                                       'Name' => 'odph_linux_pthread_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44429' => {
                                       'BaseType' => '44435',
                                       'Name' => 'odph_linux_thr_params_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44435' => {
                                       'BaseType' => '43003',
                                       'Name' => 'odph_linux_thr_params_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '45706' => {
                                       'BaseType' => '43127',
                                       'Name' => 'odph_linux_process_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '66' => {
                                    'Name' => 'long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '73' => {
                                    'BaseType' => '84',
                                    'Header' => 'stdint.h',
                                    'Line' => '48',
                                    'Name' => 'uint8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '7531' => {
                                      'BaseType' => '105',
                                      'Header' => 'stdint.h',
                                      'Line' => '55',
                                      'Name' => 'uint64_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7542' => {
                                      'Header' => 'table.h',
                                      'Line' => '98',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '73'
                                                         }
                                                },
                                      'Name' => 'anon-struct-table.h-98',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '7563' => {
                                      'BaseType' => '7574',
                                      'Header' => 'table.h',
                                      'Line' => '98',
                                      'Name' => 'odph_table_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7574' => {
                                      'BaseType' => '7542',
                                      'Name' => 'anon-struct-table.h-98*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7580' => {
                                      'BaseType' => '7591',
                                      'Header' => 'table.h',
                                      'Line' => '117',
                                      'Name' => 'odph_table_create',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7591' => {
                                      'Name' => 'odph_table_t(*)(char const*, uint32_t, uint32_t, uint32_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '167'
                                                          },
                                                   '1' => {
                                                            'type' => '1134'
                                                          },
                                                   '2' => {
                                                            'type' => '1134'
                                                          },
                                                   '3' => {
                                                            'type' => '1134'
                                                          }
                                                 },
                                      'Return' => '7563',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7627' => {
                                      'BaseType' => '7638',
                                      'Header' => 'table.h',
                                      'Line' => '134',
                                      'Name' => 'odph_table_lookup',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7638' => {
                                      'Name' => 'odph_table_t(*)(char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '167'
                                                          }
                                                 },
                                      'Return' => '7563',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7659' => {
                                      'BaseType' => '7670',
                                      'Header' => 'table.h',
                                      'Line' => '148',
                                      'Name' => 'odph_table_destroy',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7670' => {
                                      'Name' => 'int(*)(odph_table_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7563'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7691' => {
                                      'BaseType' => '7702',
                                      'Header' => 'table.h',
                                      'Line' => '170',
                                      'Name' => 'odph_table_put_value',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7702' => {
                                      'Name' => 'int(*)(odph_table_t, void*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7563'
                                                          },
                                                   '1' => {
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'type' => '152'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7733' => {
                                      'BaseType' => '7744',
                                      'Header' => 'table.h',
                                      'Line' => '199',
                                      'Name' => 'odph_table_get_value',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7744' => {
                                      'Name' => 'int(*)(odph_table_t, void*, void*, uint32_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7563'
                                                          },
                                                   '1' => {
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'type' => '152'
                                                          },
                                                   '3' => {
                                                            'type' => '1134'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7780' => {
                                      'BaseType' => '7791',
                                      'Header' => 'table.h',
                                      'Line' => '219',
                                      'Name' => 'odph_table_remove_value',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7791' => {
                                      'Name' => 'int(*)(odph_table_t, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7563'
                                                          },
                                                   '1' => {
                                                            'type' => '152'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7817' => {
                                      'Header' => 'table.h',
                                      'Line' => '224',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'f_create',
                                                           'offset' => '0',
                                                           'type' => '7580'
                                                         },
                                                  '1' => {
                                                           'name' => 'f_lookup',
                                                           'offset' => '8',
                                                           'type' => '7627'
                                                         },
                                                  '2' => {
                                                           'name' => 'f_des',
                                                           'offset' => '16',
                                                           'type' => '7659'
                                                         },
                                                  '3' => {
                                                           'name' => 'f_put',
                                                           'offset' => '24',
                                                           'type' => '7691'
                                                         },
                                                  '4' => {
                                                           'name' => 'f_get',
                                                           'offset' => '32',
                                                           'type' => '7733'
                                                         },
                                                  '5' => {
                                                           'name' => 'f_remove',
                                                           'offset' => '40',
                                                           'type' => '7780'
                                                         }
                                                },
                                      'Name' => 'struct odph_table_ops_t',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7902' => {
                                      'BaseType' => '7817',
                                      'Header' => 'table.h',
                                      'Line' => '234',
                                      'Name' => 'odph_table_ops_t',
                                      'Size' => '48',
                                      'Type' => 'Typedef'
                                    },
                          '84' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '91' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '978' => {
                                     'BaseType' => '215',
                                     'Name' => 'odph_ethaddr_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '98' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libodphelper.so.120.0.0' => {
                                                                 '_ITM_deregisterTMCloneTable' => 0,
                                                                 '_ITM_registerTMCloneTable' => 0,
                                                                 '_Jv_RegisterClasses' => 0,
                                                                 '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                                 '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                                 '__gmon_start__' => 0,
                                                                 '__printf_chk@GLIBC_2.3.4' => 0,
                                                                 '__sched_cpucount@GLIBC_2.6' => 0,
                                                                 '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                                 '__sprintf_chk@GLIBC_2.3.4' => 0,
                                                                 '__stack_chk_fail@GLIBC_2.4' => 0,
                                                                 '_exit@GLIBC_2.2.5' => 0,
                                                                 'fork@GLIBC_2.2.5' => 0,
                                                                 'getenv@GLIBC_2.2.5' => 0,
                                                                 'getpid@GLIBC_2.2.5' => 0,
                                                                 'getppid@GLIBC_2.2.5' => 0,
                                                                 'kill@GLIBC_2.2.5' => 0,
                                                                 'memcmp@GLIBC_2.2.5' => 0,
                                                                 'memcpy@GLIBC_2.14' => 0,
                                                                 'memset@GLIBC_2.2.5' => 0,
                                                                 'odp_be_to_cpu_16' => 0,
                                                                 'odp_buffer_addr' => 0,
                                                                 'odp_buffer_alloc' => 0,
                                                                 'odp_buffer_free' => 0,
                                                                 'odp_buffer_from_event' => 0,
                                                                 'odp_buffer_to_event' => 0,
                                                                 'odp_cpu_count' => 0,
                                                                 'odp_cpumask_count' => 0,
                                                                 'odp_cpumask_first' => 0,
                                                                 'odp_cpumask_next' => 0,
                                                                 'odp_cpumask_set' => 0,
                                                                 'odp_cpumask_zero' => 0,
                                                                 'odp_hash_crc32c' => 0,
                                                                 'odp_init_local' => 0,
                                                                 'odp_packet_copy_from_mem' => 0,
                                                                 'odp_packet_copy_to_mem' => 0,
                                                                 'odp_packet_has_ipv4' => 0,
                                                                 'odp_packet_has_ipv6' => 0,
                                                                 'odp_packet_has_sctp' => 0,
                                                                 'odp_packet_has_tcp' => 0,
                                                                 'odp_packet_has_udp' => 0,
                                                                 'odp_packet_l3_offset' => 0,
                                                                 'odp_packet_l3_ptr' => 0,
                                                                 'odp_packet_l4_offset' => 0,
                                                                 'odp_packet_l4_ptr' => 0,
                                                                 'odp_packet_len' => 0,
                                                                 'odp_packet_offset' => 0,
                                                                 'odp_pool_capability' => 0,
                                                                 'odp_pool_create' => 0,
                                                                 'odp_pool_destroy' => 0,
                                                                 'odp_pool_lookup' => 0,
                                                                 'odp_pool_param_init' => 0,
                                                                 'odp_queue_capability' => 0,
                                                                 'odp_queue_create' => 0,
                                                                 'odp_queue_deq' => 0,
                                                                 'odp_queue_destroy' => 0,
                                                                 'odp_queue_enq' => 0,
                                                                 'odp_queue_param_init' => 0,
                                                                 'odp_rwlock_init' => 0,
                                                                 'odp_rwlock_read_lock' => 0,
                                                                 'odp_rwlock_read_unlock' => 0,
                                                                 'odp_rwlock_write_lock' => 0,
                                                                 'odp_rwlock_write_unlock' => 0,
                                                                 'odp_shm_addr' => 0,
                                                                 'odp_shm_free' => 0,
                                                                 'odp_shm_lookup' => 0,
                                                                 'odp_shm_reserve' => 0,
                                                                 'odp_term_local' => 0,
                                                                 'prctl@GLIBC_2.2.5' => 0,
                                                                 'pthread_attr_destroy@GLIBC_2.2.5' => 0,
                                                                 'pthread_attr_init@GLIBC_2.2.5' => 0,
                                                                 'pthread_attr_setaffinity_np@GLIBC_2.3.4' => 0,
                                                                 'pthread_create@GLIBC_2.2.5' => 0,
                                                                 'pthread_getaffinity_np@GLIBC_2.3.4' => 0,
                                                                 'pthread_join@GLIBC_2.2.5' => 0,
                                                                 'pthread_self@GLIBC_2.2.5' => 0,
                                                                 'pthread_setaffinity_np@GLIBC_2.3.4' => 0,
                                                                 'sched_getaffinity@GLIBC_2.3.4' => 0,
                                                                 'sched_setaffinity@GLIBC_2.3.4' => 0,
                                                                 'snprintf@GLIBC_2.2.5' => 0,
                                                                 'sscanf@GLIBC_2.2.5' => 0,
                                                                 'stderr@GLIBC_2.2.5' => 0,
                                                                 'strcmp@GLIBC_2.2.5' => 0,
                                                                 'strncpy@GLIBC_2.2.5' => 0,
                                                                 'strsignal@GLIBC_2.2.5' => 0,
                                                                 'strtol@GLIBC_2.2.5' => 0,
                                                                 'syscall@GLIBC_2.2.5' => 0,
                                                                 'wait@GLIBC_2.2.5' => 0,
                                                                 'waitpid@GLIBC_2.2.5' => 0
                                                               }
                                },
          'WordSize' => '8'
        };
